MERGE INTO reservation_time(id, start_at) KEY (id) VALUES
    (1, '10:00'),
    (2, '11:00'),
    (3, '12:00'),
    (4, '13:00'),
    (5, '14:00'),
    (6, '15:00'),
    (7, '16:00'),
    (8, '17:00'),
    (9, '18:00'),
    (10, '19:00'),
    (11, '20:00');

MERGE INTO member(id, name, email, password, role) KEY (id) VALUES
    (1, '브라운', 'brown@email.com', 'password', 'USER'),
    (2, '제리', 'jerry@email.com', 'password', 'USER'),
    (3, '포비', 'pobi@email.com', 'password', 'USER'),
    (4, '수달', 'sudal@email.com', 'password', 'USER'),
    (5, '리사', 'lisa@email.com', 'password', 'USER'),
    (6, '마크', 'mark@email.com', 'password', 'USER'),
    (7, '제니', 'jenny@email.com', 'password', 'USER'),
    (8, '토미', 'tommy@email.com', 'password', 'USER'),
    (9, '지수', 'jisoo@email.com', 'password', 'USER'),
    (10, '로라', 'laura@email.com', 'password', 'USER'),
    (11, '케빈', 'kevin@email.com', 'password', 'USER'),
    (12, '하늘', 'haneul@email.com', 'password', 'USER'),
    (13, '바다', 'bada@email.com', 'password', 'USER'),
    (14, '별빛', 'byeolbit@email.com', 'password', 'USER'),
    (15, '노을', 'noeul@email.com', 'password', 'USER'),
    (16, '새벽', 'saebyeok@email.com', 'password', 'USER'),
    (17, '대길', 'admin1@email.com', 'admin1', 'ADMIN'),
    (18, '민준', 'admin2@email.com', 'admin2', 'ADMIN');

MERGE INTO store(id, name) KEY (id) VALUES
    (1, '판교점'),
    (2, '잠실점');

MERGE INTO store_manager(id, member_id, store_id) KEY (id) VALUES
    (1, 17, 1),
    (2, 18, 2);

MERGE INTO theme(name, description, thumbnail) KEY (name, description, thumbnail) VALUES
    ('시간조작자 연구소', '반복되는 1시간, 탈출 못하면 다시 시작된다.', '/images/themes/1.png'),
    ('사라진 개발자', '흔적만 남긴 채 사라진 개발자의 마지막 로그를 추적한다.', '/images/themes/2.png'),
    ('404호의 비밀', '존재하지 않는 방, 들어간 사람은 돌아오지 않는다.', '/images/themes/3.png'),
    ('녹화된 마지막 하루', '누군가의 마지막 하루를 되돌려 탈출해야 한다.', '/images/themes/4.png'),
    ('VIP 전용 금고', '제한 시간 내 금고를 열지 못하면 시스템이 초기화된다.', '/images/themes/5.png'),
    ('버그 추적자: 죽음의 디버깅', '무한 루프에 빠진 시스템 속에서 치명적인 오류를 찾아라.', '/images/themes/6.png'),
    ('9회말 2사 만루', '승리를 눈앞에 두고 사라진 투수, 마운드 위의 미스터리.', '/images/themes/7.png'),
    ('새벽 2시의 증류소', '금지된 레시피를 훔치러 간 바(Bar), 의문의 알람이 울린다.', '/images/themes/8.png'),
    ('잊혀진 기억의 숲', '잃어버린 과거의 파편을 모아야만 숲의 문이 열린다.', '/images/themes/10.png'),
    ('명탐정의 마지막 조각', '미해결 사건의 결정적 증거가 숨겨진 서재를 탐색하라.', '/images/themes/11.png'),
    ('인공지능의 반란', '통제 불능이 된 메인 프레임을 셧다운하고 기지를 탈출하라.', '/images/themes/12.png'),
    ('한밤중의 도서관', '자정의 종이 울리면 책 속에 갇힌 유령들이 깨어난다.', '/images/themes/13.png');

-- theme_id / 순위
-- 1 (시간조작자 연구소) : 9회 / 4위
-- 2 (사라진 개발자) : 7회 / 6위
-- 3 (404호의 비밀) : 6회 / 8위
-- 4 (녹화된 마지막 하루) : 11회 / 3위
-- 5 (VIP 전용 금고) : 4회 / 11위
-- 6 (버그 추적자: 죽음의 디버깅) : 6회 / 9위
-- 7 (9회말 2사 만루) : 12회 / 2위
-- 8 (새벽 2시의 증류소) : 7회 / 7위
-- 9 (잊혀진 기억의 숲) : 8회 / 5위
-- 10 (명탐정의 마지막 조각) : 3회 / 12위
-- 11 (인공지능의 반란) : 6회 / 10위
-- 12 (한밤중의 도서관) : 14회 / 1위
MERGE INTO reservation(member_id, store_id, date, time_id, theme_id) KEY (member_id, store_id, date, time_id, theme_id) VALUES
    (1, 1, '2026-04-30', 1, 1),
    (2, 1, '2026-04-30', 2, 1),
    (3, 1, '2026-04-30', 3, 1),
    (4, 1, '2026-04-30', 4, 1),
    (5, 1, '2026-04-30', 5, 1),
    (6, 1, '2026-04-30', 6, 1),
    (7, 1, '2026-04-30', 7, 1),
    (8, 1, '2026-04-30', 8, 1),
    (9, 1, '2026-04-30', 9, 1),
    (10, 1, '2026-04-30', 1, 2),
    (11, 1, '2026-04-30', 2, 2),
    (12, 1, '2026-04-30', 3, 2),
    (13, 1, '2026-04-30', 4, 2),
    (14, 1, '2026-04-30', 5, 2),
    (15, 1, '2026-04-30', 6, 2),
    (16, 1, '2026-04-30', 7, 2),
    (1, 1, '2026-04-30', 1, 3),
    (2, 1, '2026-04-30', 2, 3),
    (3, 1, '2026-04-30', 3, 3),
    (4, 1, '2026-04-30', 4, 3),
    (5, 1, '2026-04-30', 5, 3),
    (6, 1, '2026-04-30', 6, 3),
    (7, 1, '2026-04-30', 1, 4),
    (4, 2, '2026-04-30', 9, 7),
    (8, 1, '2026-04-30', 2, 4),
    (9, 1, '2026-04-30', 3, 4),
    (10, 1, '2026-04-30', 4, 4),
    (11, 1, '2026-04-30', 5, 4),
    (12, 1, '2026-04-30', 6, 4),
    (13, 1, '2026-04-30', 7, 4),
    (14, 1, '2026-04-30', 8, 4),
    (15, 1, '2026-04-30', 9, 4),
    (16, 1, '2026-04-30', 10, 4),
    (1, 1, '2026-04-30', 11, 4),
    (2, 1, '2026-04-30', 1, 5),
    (3, 1, '2026-04-30', 2, 5),
    (4, 1, '2026-04-30', 3, 5),
    (5, 1, '2026-04-30', 4, 5),
    (6, 1, '2026-04-30', 1, 6),
    (7, 1, '2026-04-30', 2, 6),
    (8, 1, '2026-04-30', 3, 6),
    (9, 1, '2026-04-30', 4, 6),
    (10, 1, '2026-04-30', 5, 6),
    (11, 1, '2026-04-30', 6, 6),
    (12, 2, '2026-04-30', 1, 7),
    (13, 2, '2026-04-30', 2, 7),
    (14, 2, '2026-04-30', 3, 7),
    (15, 2, '2026-04-30', 4, 7),
    (16, 2, '2026-04-30', 5, 7),
    (1, 2, '2026-04-30', 6, 7),
    (2, 2, '2026-04-30', 7, 7),
    (3, 2, '2026-04-30', 8, 7),
    (5, 2, '2026-04-30', 10, 7),
    (6, 2, '2026-04-30', 11, 7),
    (7, 2, '2026-05-01', 1, 7),
    (8, 2, '2026-04-30', 1, 8),
    (9, 2, '2026-04-30', 2, 8),
    (10, 2, '2026-04-30', 3, 8),
    (11, 2, '2026-04-30', 4, 8),
    (12, 2, '2026-04-30', 5, 8),
    (13, 2, '2026-04-30', 6, 8),
    (14, 2, '2026-04-30', 7, 8),
    (15, 2, '2026-04-30', 1, 9),
    (16, 2, '2026-04-30', 2, 9),
    (1, 2, '2026-04-30', 3, 9),
    (2, 2, '2026-04-30', 4, 9),
    (3, 2, '2026-04-30', 5, 9),
    (4, 2, '2026-04-30', 6, 9),
    (5, 2, '2026-04-30', 7, 9),
    (6, 2, '2026-04-30', 8, 9),
    (7, 2, '2026-04-30', 1, 10),
    (8, 2, '2026-04-30', 2, 10),
    (9, 2, '2026-04-30', 3, 10),
    (10, 2, '2026-04-30', 1, 11),
    (11, 2, '2026-04-30', 2, 11),
    (12, 2, '2026-04-30', 3, 11),
    (13, 2, '2026-04-30', 4, 11),
    (14, 2, '2026-04-30', 5, 11),
    (15, 2, '2026-04-30', 6, 11),
    (16, 2, '2026-04-30', 1, 12),
    (1, 2, '2026-04-30', 2, 12),
    (2, 2, '2026-04-30', 3, 12),
    (3, 2, '2026-04-30', 4, 12),
    (4, 2, '2026-04-30', 5, 12),
    (5, 2, '2026-04-30', 6, 12),
    (6, 2, '2026-04-30', 7, 12),
    (7, 2, '2026-04-30', 8, 12),
    (8, 2, '2026-04-30', 9, 12),
    (9, 2, '2026-04-30', 10, 12),
    (10, 2, '2026-04-30', 11, 12),
    (11, 2, '2026-05-01', 1, 12),
    (12, 2, '2026-05-01', 2, 12),
    (13, 2, '2026-05-01', 3, 12);

ALTER TABLE member ALTER COLUMN id RESTART WITH 19;
ALTER TABLE reservation_time ALTER COLUMN id RESTART WITH 12;
